# -*- eval: (my/execute-startup-blocks)

#+title: Editor Integrated REPL Driven Development for all Languages
#+author: Musa Al-hassy
# 🗣 “moo saw”; and “al-hassy” rhymes with “classy”

** Specification: ~(𝓅𝓇𝒾𝓃𝓉 (𝓇ℯ𝒶𝒹 string)) ≈ string~  and  ~(𝓇ℯ𝒶𝒹 (𝓅𝓇𝒾𝓃𝓉 data)) ≈ data~

# For example, in Emacs Lisp,
#+name: startup-code
#+begin_src emacs-lisp
     (setq string  "(Abraham :wives (hagar sarah) :sons (ishameal yacoub))") ;; all green, one string
     (setq data    '(Abraham :wives (hagar sarah) :sons (ishameal yacoub)))  ;; somethings are blue; data; code!

     (defun 𝓅𝓇𝒾𝓃𝓉 (d) (s-trim (s-collapse-whitespace (pp-to-string d))))
     (defun 𝓇ℯ𝒶𝒹 (s) (read s))
#+end_src

#+RESULTS: startup-code
: EmacsConf:\ Let\'s\ see\ some\ more...

